// 车牌号校验规则
export const LICENSE_PLATE_RULE = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领临][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4,5}[A-HJ-NP-Z0-9挂学警港澳]$/

// 省份/地区
export const PROVINCE_LIST = ['京', '津', '渝', '沪', '冀', '晋', '辽', '吉', '黑', '苏', '浙', '皖', '闽', '赣', '鲁', '豫', '鄂', '湘', '粤', '琼', '川', '贵', '云', '陕', '甘', '青', '蒙', '桂', '宁', '新', '藏', '临']
// 数字
export const NUMBER_LIST = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
// 字母
export const LETTER_LIST = ['Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '警', '港', '澳', '领', '挂', '学']

// 车牌号长度
export enum LICENSE_PLATE_LENGTH {
  NEV = 8, // 新能源
  ICE = 7, // 内燃机
}
